<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class ArticalSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('articles')->insert(['title' => 'مع الله',

            'description' => 'برنامج "بودكاست العرب" هو برنامج يعتمد على تقديم المحتوى الصوتي عبر الإنترنت، وقد تناول فيه المقدم موضوعات مختلفة مع ضيوف متعددين. تم إطلاق اللقاءات في عدة سلاسل تضمنت مجموعة من الحلقات المختلفة والمتنوعة.

تم تصوير وإنتاج البرنامج في استديوهات دروب السلام ',
            'image1' => '1.jpg',
            'image2' => '1.jpg',
            'image3' => '1.jpg',
            'userId'=>1,
            'typeId'=>1,
            'created_at'=>'2023-11-10 14:32:01',

        ]);
        DB::table('articles')->insert([
                        'title' => 'مع الله',

            'description' => 'برنامج "بودكاست العرب" هو برنامج يعتمد على تقديم المحتوى الصوتي عبر الإنترنت، وقد تناول فيه المقدم موضوعات مختلفة مع ضيوف متعددين. تم إطلاق اللقاءات في عدة سلاسل تضمنت مجموعة من الحلقات المختلفة والمتنوعة.

تم تصوير وإنتاج البرنامج في استديوهات دروب السلام ',
            'image1' => '1.jpg',
            'image2' => '1.jpg',
            'image3' => '1.jpg',
            'userId'=>1,
            'typeId'=>1,
            'created_at'=>'2023-11-10 14:32:01',

        ]);
        DB::table('articles')->insert([
            'title' => 'مع الله',
            'description' => 'برنامج "بودكاست العرب" هو برنامج يعتمد على تقديم المحتوى الصوتي عبر الإنترنت، وقد تناول فيه المقدم موضوعات مختلفة مع ضيوف متعددين. تم إطلاق اللقاءات في عدة سلاسل تضمنت مجموعة من الحلقات المختلفة والمتنوعة.

تم تصوير وإنتاج البرنامج في استديوهات دروب السلام ',
            'image1' => '1.jpg',
            'image2' => '1.jpg',
            'image3' => '1.jpg',
            'userId'=>1,
            'typeId'=>1,
            'created_at'=>'2023-11-10 14:32:01',

        ]);
    }
}
